#+TITLE: August 15-30, 2019 (16 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2019-08-15 Thu>
  :wpd-sandeepk: 1
  :wpd-jasonbraganza: 3 
  :END:
** jasonbraganza
*** NIOS - Geography - 2 [0/6]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: jasonbraganza
    :ID: READ.1566209210
    :TASKID: READ.1566209210
    :END:
    - [ ] Byheart chapters (1h)
    - [ ] Byheart chapters (1h)
    - [ ] Byheart chapters (1h)
    - [ ] Byheart chapters (1h)
    - [ ] Byheart chapters (1h)
    - [ ] Byheart chapters (1h)
*** IN_PROGRESS Mentor Assigned Programming / Tech Problems - 1 [4/6]
    :PROPERTIES:
    :ESTIMATED: 12
    :ACTUAL:   8.37
    :OWNER: jasonbraganza
    :ID: DEV.1566208948
    :TASKID: DEV.1566208948
    :END:      
    :LOGBOOK:
    CLOCK: [2019-08-22 Thu 11:20]--[2019-08-22 Thu 12:27] =>  1:07
    CLOCK: [2019-08-22 Thu 09:51]--[2019-08-22 Thu 11:06] =>  1:15
    CLOCK: [2019-08-22 Thu 09:18]--[2019-08-22 Thu 09:36] =>  0:18
    CLOCK: [2019-08-21 Wed 17:07]--[2019-08-21 Wed 19:44] =>  2:37
    CLOCK: [2019-08-21 Wed 14:15]--[2019-08-21 Wed 15:15] =>  1:00
    CLOCK: [2019-08-21 Wed 11:00]--[2019-08-21 Wed 13:05] =>  2:05
    :END:
    - [X] Tackle problem (2h)
    - [X] Tackle problem (2h)
    - [X] Tackle problem (2h)
    - [X] Tackle problem (2h)
    - [ ] Tackle problem (2h)
    - [ ] Tackle problem (2h)
*** Python Jumpstart by Building 10 Apps - 2 [0/6]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:   0.00
    :OWNER: jasonbraganza
    :ID: DEV.1564482384
    :TASKID: DEV.1564482384
    :END:      
    :LOGBOOK:
    :END:
    - [ ] Tackle problem (1h)
    - [ ] Tackle problem (1h)
    - [ ] Tackle problem (1h)
    - [ ] Tackle problem (1h)
    - [ ] Tackle problem (1h)
    - [ ] Tackle problem (1h)
*** DONE Read Lutz Learning Python - 2 [6/6]
    CLOSED: [2019-08-25 Sun 19:40]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:   15.65
    :OWNER: jasonbraganza
    :ID: READ.1564479823
    :TASKID: READ.1564479823
    :END:      
    :LOGBOOK:
    CLOCK: [2019-08-25 Sun 17:45]--[2019-08-25 Sun 19:40] =>  1:55
    CLOCK: [2019-08-25 Sun 14:15]--[2019-08-25 Sun 15:15] =>  1:00
    CLOCK: [2019-08-25 Sun 11:30]--[2019-08-25 Sun 12:40] =>  1:10
    CLOCK: [2019-08-24 Sat 15:31]--[2019-08-24 Sat 17:20] =>  1:49
    CLOCK: [2019-08-24 Sat 12:54]--[2019-08-24 Sat 13:30] =>  0:36
    CLOCK: [2019-08-24 Sat 10:50]--[2019-08-24 Sat 12:10] =>  1:20
    CLOCK: [2019-08-23 Fri 21:27]--[2019-08-23 Fri 21:49] =>  0:22
    CLOCK: [2019-08-23 Fri 17:40]--[2019-08-23 Fri 19:32] =>  1:52
    CLOCK: [2019-08-23 Fri 16:19]--[2019-08-23 Fri 17:27] =>  1:08
    CLOCK: [2019-08-23 Fri 14:26]--[2019-08-23 Fri 15:58] =>  1:32
    CLOCK: [2019-08-22 Thu 16:20]--[2019-08-22 Thu 18:45] =>  2:25
    CLOCK: [2019-08-20 TUe 14:30]--[2019-08-20 Tue 15:00] =>  0:30
    :END:
    - [X] Read Learning Python (1h)
    - [X] Read Learning Python (1h)
    - [X] Read Learning Python (1h)
    - [X] Read Learning Python (1h)
    - [X] Read Learning Python (1h)
    - [X] Read Learning Python (1h)
*** IN_PROGRESS Work at French, in the Fluent forever app - Part VI [10/16]
    :PROPERTIES:
    :ESTIMATED: 16
    :ACTUAL:   12.07
    :OWNER: jasonbraganza
    :ID: WRITE.1557903518
    :TASKID: WRITE.1557903518
    :END:
    :LOGBOOK:
    CLOCK: [2019-08-25 Sun 07:30]--[2019-08-25 Sun 08:55] =>  1:25
    CLOCK: [2019-08-24 Sat 10:10]--[2019-08-24 Sat 10:50] =>  0:40
    CLOCK: [2019-08-23 Fri 07:40]--[2019-08-23 Fri 08:30] =>  0:50
    CLOCK: [2019-08-22 Thu 07:00]--[2019-08-22 Thu 08:08] =>  1:08
    CLOCK: [2019-08-21 Wed 06:30]--[2019-08-21 Wed 07:30] =>  1:00
    CLOCK: [2019-08-20 Tue 07:30]--[2019-08-20 Tue 08:41] =>  1:11
    CLOCK: [2019-08-19 Mon 07:30]--[2019-08-19 Mon 08:15] =>  0:45
    CLOCK: [2019-08-18 Sun 06:15]--[2019-08-18 Sun 07:30] =>  1:15
    CLOCK: [2019-08-17 Sat 07:00]--[2019-08-17 Sat 08:20] =>  1:20
    CLOCK: [2019-08-16 Fri 07:00]--[2019-08-16 Fri 08:15] =>  1:15
    CLOCK: [2019-08-15 Thu 07:00]--[2019-08-15 Thu 08:15] =>  1:15
    :END:      
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [X] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
    - [ ] Complete 1 review session & add 5 words to vocabulary (1h)
*** Write twice a week - 4 [0/4]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   
    :OWNER: jasonbraganza
    :ID: WRITE.1559630427
    :TASKID: WRITE.1559630427
    :END:
    :LOGBOOK:
    :END:
    - [ ] Write a short blog post. (1h)
    - [ ] Write a short blog post. (1h)
    - [ ] Write a short blog post. (1h)
    - [ ] Write a short blog post. (1h)
*** Read books - 3 [0/16]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   0.00
    :OWNER: jasonbraganza
    :ID: READ.1559630918
    :TASKID: READ.1559630918
    :END:
    :LOGBOOK:
    :END:
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
    - [ ] Read (15m)
** sandeepk
*** [#B] Dive into Python3 [0/4]
    :PROPERTIES:
    :ESTIMATED: 16 
    :ACTUAL:
    :OWNER: sandeepk
    :ID: READ.1559639223
    :TASKID: READ.1559639223
    :END:
    - [ ] Chapter 2 Native Datatypes     (3h)
    - [ ] Chpater 3 Comprehensions       (4h)
    - [ ] Chapter 4 Strings              (6h)
    - [ ] Chapter 5 Regular Expressions  (3h)

